export const ukrainianRegions = [
  'Вінницька область',
  'Волинська область',
  'Дніпропетровська область',
  'Житомирська область',
  'Закарпатська область',
  'Запоріжська область',
  'Івано-Франківська область',
  'Київська область',
  'Кіровоградська область',
  'Львівська область',
  'Миколаївська область',
  'Одеська область',
  'Полтавська область',
  'Рівненська область',
  'Сумська область',
  'Тернопільска область',
  'Харківська область',
  'Херсонська область',
  'Хмельницька область',
  'Черкаська область',
  'Чернігівська область',
  'Чернівецька область',
];

const ukrainianRegionsForList = [];

ukrainianRegions.forEach((item) =>
  ukrainianRegionsForList.push({ name: item }),
);

export default ukrainianRegionsForList;
